# AnalyticalElementPhysicalAsset Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..AnalyticalElementPhysicalAsset Property
ParameterTypeId Class See Also
---
"Physical Material Asset": Used for Analytical Elements.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId AnalyticalElementPhysicalAsset { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AnalyticalElementPhysicalAsset As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ AnalyticalElementPhysicalAsset {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace